const quizData = {
    "units": [
      {
        "id": 1,
        "name": "شوكيات الجلد واللافقاريات الحبلية",
        "description": "لشوكيات الجلد واللافقاريات الحبلية صفات تربطها مع الحبليات",
        "questions": [
          {
            "text": "أنابيب صغيرة وعضلية تمتلئ بسائل وتنتهي بممص قرصي يستعمل في الحركة وجمع الغذاء والتنفس",
            "options": [
              "الحويصلات العضلية",
              "الأقدام الأنبوبية",
              "الخياشيم",
              "المصفاة"
            ],
            "correct": 1
          },
          {
            "text": "يستعمل صفائح شبيهة بالأسنان لكشط الطحالب عن الأسطح أو تتغذى على حيوانات أخرى",
            "options": [
              "نجم البحر",
              "نجم البحر الهش",
              "قنفذ البحر",
              "خيار البحر"
            ],
            "correct": 2
          },
          {
            "text": "من شوكيات الجلد ويستعمل الشجرة التنفسية في التنفس",
            "options": [
              "نجم البحر",
              "نجم البحر الهش",
              "قنفذ البحر",
              "خيار البحر"
            ],
            "correct": 3
          },
          {
            "text": "أحد شوكيات الجلد آكل للنبات يقشط الطحالب عن الصخور",
            "options": [
              "نجم البحر",
              "أقحوان البحر",
              "قنفذ البحر",
              "خيار البحر"
            ],
            "correct": 2
          },
          {
            "text": "لمعظم قنافذ البحر أجهزة مضغ داخل أفواهها تتكون من خمس صفائح تشبه الأسنان تسمى",
            "options": [
              "الأقدام الأنبوبية",
              "الشجرة التنفسية",
              "المرشحات",
              "مصباح أرسطو"
            ],
            "correct": 3
          },
          {
            "text": "اكتشفت عام 1986 قبالة شواطئ نيوزيلندا -تتميز بقلة أعدادها- شكلها قرصي دون أذرع",
            "options": [
              "اللؤلؤية البحرية",
              "نجم البحر الهش",
              "قنفذ البحر",
              "خيار البحر"
            ],
            "correct": 0
          },
          {
            "text": "العلاقة بين نجم البحر الهش والإسفنج هي علاقة",
            "options": [
              "تطفل",
              "تعايش",
              "تقايض",
              "ترمم"
            ],
            "correct": 1
          }
        ]
      },
      {
        "id": 2,
        "name": "الأسماك والبرمائيات",
        "description": "خلق الله للأسماك تكيفات تساعدها على العيش في البيئات المائية، في حين تكيفت معظم البرمائيات لتعيش جزءًا من حياتها على اليابسة",
        "questions": [
          {
            "text": "تشمل تحت شعبة الفقاريات",
            "options": [
              "3 طوائف",
              "4 طوائف",
              "5 طوائف",
              "6 طوائف"
            ],
            "correct": 2
          },
          {
            "text": "يحل العمود الفقري محل ............. خلال النمو الجنيني:",
            "options": [
              "الحبل العصبي",
              "الحبل الظهري",
              "النخاع الشوكي",
              "العرف العصبي"
            ],
            "correct": 1
          },
          {
            "text": "يتكون أثناء تكون الحبل العصبي خلال النمو الجنيني في الفقاريات من الطبقة الخارجية للجنين",
            "options": [
              "العرف العصبي",
              "الكبد",
              "الكلى",
              "القلب"
            ],
            "correct": 0
          },
          {
            "text": "تنمو الفكوك في الأسماك من",
            "options": [
              "الجيوب البلعومية",
              "الخياشيم",
              "القشور",
              "الأقواس الخيشومية"
            ],
            "correct": 3
          },
          {
            "text": "من الزعانف المزدوجة في الأسماك",
            "options": [
              "الزعنفة الذيلية",
              "الزعنفة  الظهرية",
              "الزعنفة الشرجية",
              "الزعنفة الحوضية"
            ],
            "correct": 3
          },
          {
            "text": "تركيب يشبه المجداف على جسم السمكة يستعمل للتوازن وتغيير اتجاه الحركة والاندفاع للأمام",
            "options": [
              "الفك",
              "الزعنفة",
              "القشور",
              "النفرون"
            ],
            "correct": 1
          },
          {
            "text": "تراكيب صغيرة مسطحة تشبه الصفيحة بالقرب من سطح الجلد",
            "options": [
              "الخياشيم",
              "الزعنفة",
              "القشور",
              "النفرون"
            ],
            "correct": 2
          },
          {
            "text": "قشور تتكون من عظم وجلد وتكون رقيقة ومرنة",
            "options": [
              "القشور المشطية",
              "القشور القرصية",
              "القشور الصفائحية",
              "القشور المعينية"
            ],
            "correct": 1
          },
          {
            "text": "قشور تتكون من عظم ومينا وتغطي جلد سمكة الرمح",
            "options": [
              "القشور المشطية",
              "القشور القرصية",
              "القشور الصفائحية",
              "القشور المعينية"
            ],
            "correct": 3
          },
          {
            "text": "قشور تتكون من عظم ومن مواد قاسية وثقيلة تشبه الأسنان وتغطي سمكة القرش",
            "options": [
              "القشور المشطية",
              "القشور القرصية",
              "القشور الصفائحية",
              "القشور المعينية"
            ],
            "correct": 2
          },
          {
            "text": "يتكون القلب في الأسماك من",
            "options": [
              "حجرة واحدة",
              "حجرتين",
              "3 حجرات",
              "4 حجرات"
            ],
            "correct": 1
          },
          {
            "text": "إحدى الكائنات التالية يمتلك جهاز دوري ذو دورة واحدة متصلة",
            "options": [
              "العلجوم",
              "السلمندر",
              "الصقر",
              "سمكة القرش"
            ],
            "correct": 3
          },
          {
            "text": "تنقى الفضلات الخلوية من دماء الأسماك بواسطة أعضاء تسمى",
            "options": [
              "الكلى",
              "النخاع المستطيل",
              "الأكياس البوابية",
              "البنكرياس"
            ],
            "correct": 0
          },
          {
            "text": "الوحدة الوظيفية الأساسية للكلية هي",
            "options": [
              "الطبلة",
              "النفرون",
              "العرف العصبي",
              "الأذين"
            ],
            "correct": 1
          },
          {
            "text": "المسؤول عن حفظ التوازن المائي والملحي في أسماك المياه العذبة",
            "options": [
              "الخاصية الأسموزية",
              "الكلى",
              "الخياشيم",
              "ب و ج معا"
            ],
            "correct": 0
          },
          {
            "text": "المسؤول عن حفظ التوازن المائي والملحي في أسماك المياه المالحة",
            "options": [
              "الخاصية الأسموزية",
              "الكلى",
              "الخياشيم",
              "ب و ج معا"
            ],
            "correct": 3
          },
          {
            "text": "يقوم بتنسيق الحركة والتحكم في الاتزان",
            "options": [
              "المخيخ",
              "النخاع المستطيل",
              "الخط الجانبي",
              "البصيلة الشمية"
            ],
            "correct": 0
          },
          {
            "text": "يقوم باكتشاف الحركة في الماء وحفظ التوازن",
            "options": [
              "المخيخ",
              "النخاع المستطيل",
              "الخط الجانبي",
              "البصيلة الشمية"
            ],
            "correct": 2
          },
          {
            "text": "المسؤول عن حفظ التوازن في الأسماك",
            "options": [
              "الزعانف المزدوجة",
              "المخيخ",
              "جهاز الخط الجانبي",
              "جميع ما سبق"
            ],
            "correct": 3
          },
          {
            "text": "عملية تطلق فيها إناث الأسماك وذكورها أمشاجها بالقرب من بعض في الماء",
            "options": [
              "الإخراج",
              "التبويض",
              "الإخصاب",
              "التنفس"
            ],
            "correct": 2
          },
          {
            "text": "كيس مملوء بغاز مثل البالون يوجد في الأسماك العظمية يسمح للسمكة بالتحكم في عمق غوصها في الماء",
            "options": [
              "الكيس البوابي",
              "كيس المح",
              "المثانة البولية",
              "مثانة العوم"
            ],
            "correct": 3
          },
          {
            "text": "تقسم الأسماك إلى",
            "options": [
              "طائفتان",
              "3 طوائف",
              "4 طوائف",
              "5 طوائف"
            ],
            "correct": 1
          },
          {
            "text": "من أمثلة الأسماك الغضروفية",
            "options": [
              "الجريث",
              "الجلكي",
              "الراي",
              "الهامور"
            ],
            "correct": 2
          },
          {
            "text": "من الأسماك الطفيلية",
            "options": [
              "الورنك",
              "الجلكي",
              "الراي",
              "القرش"
            ],
            "correct": 1
          },
          {
            "text": "من أمثلة الأسماك اللافكية",
            "options": [
              "القرش",
              "الجلكي",
              "البلطي",
              "الورنك"
            ],
            "correct": 1
          },
          {
            "text": "الأسماك شعاعية الزعانف تتبع طائفة الأسماك",
            "options": [
              "اللافكية",
              "العظمية",
              "الغضروفية",
              "مجزأة الزعانف"
            ],
            "correct": 1
          },
          {
            "text": "أسماك تتميز زعانفها بالأجزاء العضلية ومفاصل تشبه مثيلاتها في رباعيات الأطراف",
            "options": [
              "الأسماك اللافكية",
              "شعاعية الزعانف",
              "الأسماك الغضروفية",
              "مجزأة الزعانف"
            ],
            "correct": 3
          },
          {
            "text": "يصنف سمك السلمون ضمن",
            "options": [
              "الأسماك اللافكية",
              "شعاعية الزعانف",
              "الأسماك الغضروفية",
              "مجزأة الزعانف"
            ],
            "correct": 1
          },
          {
            "text": "يصنف سمك الجريث ضمن",
            "options": [
              "الأسماك اللافكية",
              "شعاعية الزعانف",
              "الأسماك الغضروفية",
              "مجزأة الزعانف"
            ],
            "correct": 0
          },
          {
            "text": "أي تكيف يجعل من الأسماك مخلوقات مفترسة",
            "options": [
              "الزعانف المزدوجة",
              "القشور",
              "الخياشيم",
              "الفكوك"
            ],
            "correct": 3
          },
          {
            "text": "أي مما يلي من صفات سمك القرش",
            "options": [
              "عديم الفكوك - هيكل غضروفي - خط جانبي",
              "فكوك - هيكل عظمي - مثانة عوم",
              "عديم الفكوك - هيكل عظمي - زعانف شعاعية",
              "فكوك - هيكل غضروفي - خط جانبي"
            ],
            "correct": 3
          },
          {
            "text": "كائنات تبدأ حياتها بوصفها مخلوقات مائية ثم تعيش على اليابسة عندما يكتمل نموها",
            "options": [
              "الأسماك",
              "البرمائيات",
              "الزواحف",
              "الثدييات"
            ],
            "correct": 1
          },
          {
            "text": "كل مما يلي من صفات البرمائيات عدا",
            "options": [
              "جلدها مغطى بحراشف",
              "تتنفس بالجلد والرئات",
              "لها يرقات مائية",
              "الدورة الدموية مزدوجة"
            ],
            "correct": 0
          },
          {
            "text": "حجرة في نهاية الأمعاء الغليظة تستقبل فضلات الهضم وفضلات البول والأمشاج قبل مغادرة الجسم",
            "options": [
              "البطين",
              "الأذين",
              "المذروق (المجمع)",
              "الأكياس البوابية"
            ],
            "correct": 2
          },
          {
            "text": "يبدأ هضم الطعام في البرمائيات من",
            "options": [
              "الفم",
              "المعدة",
              "الأمعاء الدقيقة",
              "الأمعاء الغليظة"
            ],
            "correct": 1
          },
          {
            "text": "الناتج النهائي لأيض البروتينات في البرمائيات التي تعيش معيشة مائية هو",
            "options": [
              "اليوريا",
              "البولينا",
              "حمض البول",
              "الأمونيا"
            ],
            "correct": 3
          },
          {
            "text": "يتم تحويل الأمونيا إلى يوريا في البرمائيات التي تعيش على اليابس في",
            "options": [
              "البنكرياس",
              "الرئة",
              "الكبد",
              "الكلى"
            ],
            "correct": 2
          },
          {
            "text": "يتم التنفس في يرقات البرمائيات بواسطة",
            "options": [
              "الجلد",
              "الرئة",
              "الخياشيم",
              "أ و ج معا"
            ],
            "correct": 3
          },
          {
            "text": "يتم التنفس في البرمائيات بعد البلوغ بواسطة",
            "options": [
              "الجلد",
              "الرئة",
              "الخياشيم",
              "أ و ب معا"
            ],
            "correct": 3
          },
          {
            "text": "العضو الذي يمكن للبرمائيات التنفس من خلاله في الماء وعلى اليابس معًا هو",
            "options": [
              "الجلد",
              "الرئة",
              "الخياشيم",
              "القلب"
            ],
            "correct": 0
          },
          {
            "text": "يتكون القلب في البرمائيات من",
            "options": [
              "حجرة واحدة",
              "حجرتين",
              "3 حجرات",
              "4 حجرات"
            ],
            "correct": 2
          },
          {
            "text": "يحتوي على منطقة ذات علاقة برصد الروائح المنتشرة في الهواء",
            "options": [
              "غشاء الطبلة",
              "الغشاء الرامش",
              "المخ الأمامي",
              "مستقبلات الجلد"
            ],
            "correct": 2
          },
          {
            "text": "غشاء رقيق خارجي على جانبي رأس الضفدعة تستعمله لسماع الأصوات عالية التردد ولتضخيم الأصوات",
            "options": [
              "غشاء الطبلة",
              "الغشاء الرامش",
              "المخ الأمامي",
              "مستقبلات الجلد"
            ],
            "correct": 0
          },
          {
            "text": "جفن شفاف يستطيع التحرك فوق العين لحمايتها تحت الماء وحمايتها من الجفاف على اليابسة",
            "options": [
              "غشاء الطبلة",
              "الغشاء الرامش",
              "المخ الأمامي",
              "مستقبلات الجلد"
            ],
            "correct": 1
          },
          {
            "text": "صنف علماء الأحياء طائفة البرمائيات إلى",
            "options": [
              "3 رتب",
              "4 رتب",
              "5 رتب",
              "6 رتب"
            ],
            "correct": 0
          },
          {
            "text": "تتميز العلاجم عن الضفادع بإحدى الصفات الآتية",
            "options": [
              "الجلد الناعم",
              "الجلد به نتوءات",
              "الأرجل طويلة",
              "لا تبتعد عن الماء"
            ],
            "correct": 1
          },
          {
            "text": "برمائيات تشبه الديدان وتعيش مدفونة في التربة في الغابات الاستوائية",
            "options": [
              "الضفادع",
              "عديمة الأطراف",
              "السلمندر",
              "سمندل الماء"
            ],
            "correct": 1
          }
        ]
      },
      {
        "id": 3,
        "name": "الزواحف والطيور",
        "description": "للزواحف والطيور تكيفات تساعدها على العيش والتكاثر بنجاح على اليابسة",
        "questions": [
          {
            "text": "في البيوض الرهلية يوجد الغذاء المدخر للجنين في",
            "options": [
              "الغشاء الرهلي",
              "كيس المح",
              "كيس الممبار",
              "غشاء الكوريون"
            ],
            "correct": 1
          },
          {
            "text": "غشاء يحيط بالجنين مباشرة مملوء بسائل يحمي الجنين خلال فترات نموه",
            "options": [
              "الغشاء الرهلي",
              "كيس المح",
              "كيس الممبار",
              "غشاء الكوريون"
            ],
            "correct": 0
          },
          {
            "text": "غشاء يحتوي على الفضلات التي ينتجها الجنين",
            "options": [
              "الغشاء الرهلي",
              "كيس المح",
              "كيس الممبار",
              "غشاء الكوريون"
            ],
            "correct": 2
          },
          {
            "text": "الغشاء الخارجي للجنين أسفل القشرة مباشرة يسمح بدخول الأكسجين ويحفظ السائل داخل البيضة",
            "options": [
              "الغشاء الرهلي",
              "كيس المح",
              "كيس الممبار",
              "غشاء الكوريون"
            ],
            "correct": 3
          },
          {
            "text": "تعتمد عليها معظم الزواحف لتبادل الغازات والتنفس",
            "options": [
              "الجلد",
              "الرئات الكتبية",
              "الرئات",
              "القصبات الهوائية"
            ],
            "correct": 2
          },
          {
            "text": "يتكون القلب في معظم الزواحف من",
            "options": [
              "حجرة واحدة",
              "حجرتان",
              "3 حجرات",
              "4 حجرات"
            ],
            "correct": 2
          },
          {
            "text": "تتميز التماسيح عن باقي الزواحف بأن القلب مكون من",
            "options": [
              "حجرة واحدة",
              "حجرتان",
              "3 حجرات",
              "4 حجرات"
            ],
            "correct": 3
          },
          {
            "text": "يتم الإخراج في الزواحف عن طريق",
            "options": [
              "الخلايا اللهبية",
              "أنابيب ملبيجي",
              "النفريديا",
              "الكلى"
            ],
            "correct": 3
          },
          {
            "text": "كل مما يلي من متغيرة درجة الحرارة عدا",
            "options": [
              "الطيور",
              "الأسماك",
              "البرمائيات",
              "الزواحف"
            ],
            "correct": 0
          },
          {
            "text": "عضو الشم لدى الزواحف",
            "options": [
              "الأنف",
              "اللسان",
              "أعضاء جاكوبسون",
              "ب و ج معا"
            ],
            "correct": 3
          },
          {
            "text": "تلتقط الأفاعي الذبذبات الصوتية عن طريق",
            "options": [
              "أعضاء جاكوبسون",
              "اللسان",
              "عظام الف",
              "الأنف"
            ],
            "correct": 2
          },
          {
            "text": "عدد الرتب في الزواحف",
            "options": [
              "3 رتب",
              "4 رتب",
              "5 رتب",
              "6 رتب"
            ],
            "correct": 1
          },
          {
            "text": "تصنف الأفاعي ضمن رتبة",
            "options": [
              "الحرشفيات",
              "التمساحيات",
              "خطمية الرأس",
              "السلاحف"
            ],
            "correct": 0
          },
          {
            "text": "من أمثلة خطمية الرأس",
            "options": [
              "أفعى الجرس",
              "البايثون",
              "التواتارا",
              "الكومودو"
            ],
            "correct": 2
          },
          {
            "text": "الزواحف التي تتميز بعدم وجود أسنان",
            "options": [
              "السحالي",
              "الأفاعي",
              "التماسيح",
              "السلاحف"
            ],
            "correct": 3
          },
          {
            "text": "زوائد نمو متخصصة في جلد الطيور وتتكون من الكيراتين",
            "options": [
              "الحراشف",
              "الريش",
              "قرون الاستشعار",
              "الأسنان"
            ],
            "correct": 1
          },
          {
            "text": "تتنفس الطيور عن طريق",
            "options": [
              "القصبات الهوائية",
              "الرئات الكتابية",
              "الرئات",
              "الجلد"
            ],
            "correct": 2
          },
          {
            "text": "غدة موجودة قريبا من قاعدة ذيل الطائر تستخدم في إصلاح الروابط المنكسرة",
            "options": [
              "الغدد اللبنية",
              "الغدة الزعترية",
              "الغدة اللعابية",
              "الغدة الزيتية"
            ],
            "correct": 3
          },
          {
            "text": "من وظائف الريش في الطيور",
            "options": [
              "الطيران",
              "العزل",
              "العوم",
              "أ و ب معا"
            ],
            "correct": 3
          },
          {
            "text": "كيس عضلي سميك يمثل نهاية المعدة تحتوي على حجارة صغيرة تقوم بطحن الطعام",
            "options": [
              "الحوصلة",
              "القانصة",
              "الطاحنة",
              "البنكرياس"
            ],
            "correct": 1
          },
          {
            "text": "توجد أسفل المريء تخزن فيها الغذاء قبل ذهابه للمعدة",
            "options": [
              "الحوصلة",
              "القانصة",
              "الطاحنة",
              "البنكرياس"
            ],
            "correct": 0
          },
          {
            "text": "المادة الإخراجية في الطيور هي",
            "options": [
              "الأمونيا",
              "اليوريا",
              "حمض البوليك",
              "المخاط"
            ],
            "correct": 2
          },
          {
            "text": "توجد العيون في مقدمة الرأس في",
            "options": [
              "الحمام",
              "العصافير",
              "البط",
              "الصقور"
            ],
            "correct": 3
          },
          {
            "text": "يتم الإخراج في الطيور عن طريق",
            "options": [
              "الخلايا اللهبية",
              "أنابيب ملبيجي",
              "النفريديا",
              "الكلى"
            ],
            "correct": 3
          }
        ]
      },
      {
        "id": 4,
        "name": "الثدييات",
        "description": "ميز الله سبحانه وتعالى الثدييات بمجموعة من التكيفات المتنوعة للمحافظة على اتزانها الداخلي والعيش في البيئات المختلفة",
        "questions": [
          {
            "text": "تتميز الثدييات عن باقي الفقاريات بــــ",
            "options": [
              "الشعر",
              "الريش",
              "الغدد اللبنية",
              "أ و ج معا"
            ],
            "correct": 3
          },
          {
            "text": "يحتوي الشعر في الثدييات على بروتين ليفي قاس بيسمى",
            "options": [
              "الكايتين",
              "الكيراتين",
              "السيليلوز",
              "الميلانين"
            ],
            "correct": 1
          },
          {
            "text": "المادة الإخراجية في الثدييات هي",
            "options": [
              "الأمونيا",
              "حمض البوليك",
              "اليوريا",
              "كربونات الكالسيوم"
            ],
            "correct": 2
          },
          {
            "text": "يتم الإخراج في الثدييات بواسطة",
            "options": [
              "الخلايا اللهبية",
              "الكلى",
              "انابيب ملبيجي",
              "المعي الأعور"
            ],
            "correct": 1
          },
          {
            "text": "المخلوقات الوحيدة التي تحتوي على حجاب حاجز",
            "options": [
              "البرمائيات",
              "الزواحف",
              "الطيور",
              "الثدييات"
            ],
            "correct": 3
          },
          {
            "text": "مسؤول عن الاتزان وتنسيق الحركة حيث يسمح بالحركات الدقيقة والمعقدة في جميع الاتجاهات",
            "options": [
              "قشرة المخ",
              "النخاع المستطيل",
              "المخيخ",
              "الحجاب الحاجز"
            ],
            "correct": 2
          },
          {
            "text": "تفرز مواد تستعملها الثدييات لتحديد مناطقها أو لتجذب شريك التزاوج",
            "options": [
              "غدد الرائحة",
              "الغدد العرقية",
              "الغدد اللبنية",
              "الغدد الدهنية"
            ],
            "correct": 0
          }
        ]
      },
      {
        "id": 5,
        "name": "مقدمة في النباتات",
        "description": "النباتات مجموعة متنوعة من المخلوقات الحية، أبدعها البارئ سبحانه وتعالى",
        "questions": [
          {
            "text": "تغطي الحزازيات من سطح الأرض ما يعادل ................... من مساحتها",
            "options": [
              "0.1%",
              "0.5%",
              "1%",
              "10%"
            ],
            "correct": 2
          },
          {
            "text": "ينتج فحم الخث ( البيت ) من تراكم أحد الحزازيات التالية",
            "options": [
              "الفيوناريا",
              "السفاجنوم",
              "الماركانتيا",
              "القائمة"
            ],
            "correct": 1
          },
          {
            "text": "ينتقل الماء والمواد الأخرى خلال أجسام الحزازيات بواسطة",
            "options": [
              "الانتشار",
              "الأسموزية",
              "النقل النشط",
              "أ و ب معا"
            ],
            "correct": 3
          }
        ]
      },
      {
        "id": 6,
        "name": "تركيب النبات ووظائف أجزائه",
        "description": "تعود طبيعة التنوع في النباتات إلى اختلاف تراكيبها التي خلقها الله سبحانه وتعالى",
        "questions": [
          {
            "text": "زيادة قطر الساق والجذر فيما يعرف بالنمو الثانوي ينتج عن الأنسجة المولدة",
            "options": [
              "القمية",
              "الجانبية",
              "البينية",
              "الجذرية"
            ],
            "correct": 1
          },
          {
            "text": "إنتاج خلايا تسبب زيادة في طول النبات فيما يعرف بالنمو الابتدائي من وظائف الأنسجة المولدة",
            "options": [
              "القمية",
              "الجانبية",
              "البينية",
              "الخارجية"
            ],
            "correct": 0
          },
          {
            "text": "نسيج مولد جانبي يُنتج خلايا تكون جُدرًا قاسية وتشكل طبقة خارجية واقية على السيقان والجذور",
            "options": [
              "كامبيوم وعائي",
              "كامبيوم فليني",
              "شعيرة جذرية",
              "كيوتين"
            ],
            "correct": 1
          },
          {
            "text": "الأنسجة المولدة المسؤولة عن إنتاج زيادة طول الساق أو الأوراق بعد قصها",
            "options": [
              "القمية",
              "الجانبية",
              "البينية",
              "الجذرية"
            ],
            "correct": 2
          },
          {
            "text": "نتوءات تنتجها خلايا بشرة بعض الأوراق لحماية النبات من الحشرات ومفترسات النبات",
            "options": [
              "الثغور",
              "الشعيرات الجذرية",
              "الشعيرات الورقية",
              "الغدد السامة"
            ],
            "correct": 2
          },
          {
            "text": "فتحات صغيرة توجد في بشرة الأوراق والسيقان الخضراء",
            "options": [
              "الثغور",
              "الشعيرات الجذرية",
              "الشعيرات الورقية",
              "الغدد السامة"
            ],
            "correct": 0
          },
          {
            "text": "امتدادات هشة تخرج من خلايا البشرة في الجذر تزيد من المساحة السطحية للجذر",
            "options": [
              "الثغور",
              "الشعيرات الجذرية",
              "الشعيرات الورقية",
              "الغدد السامة"
            ],
            "correct": 1
          },
          {
            "text": "أول هرمون نباتي تم اكتشافه ويوجد منه أنواع عديدة",
            "options": [
              "الأكسين",
              "الإثيلين",
              "الجبريلين",
              "السيتوكاينين"
            ],
            "correct": 0
          },
          {
            "text": "المسؤول عن استطالة الخلايا وسيادة القمة النامية في النبات",
            "options": [
              "الأكسين",
              "الإثيلين",
              "الجبريلين",
              "السيتوكاينين"
            ],
            "correct": 0
          },
          {
            "text": "الهرمون الغازي الوحيد المعروف بالنبات",
            "options": [
              "الأكسين",
              "الإثيلين",
              "الجبريلين",
              "السيتوكاينين"
            ],
            "correct": 1
          },
          {
            "text": "تعمل على استطالة الخلايا وتحفيز انقسامها كما تؤثر في نمو البذور",
            "options": [
              "الأكسينات",
              "الجبريلينات",
              "السيتوكينينات",
              "الإثيلين"
            ],
            "correct": 1
          },
          {
            "text": "تضاف غالبا إلى الوسط الغذائي المستعمل في زراعة الأنسجة النباتية",
            "options": [
              "الأكسينات",
              "الجبريلينات",
              "السيتوكينينات",
              "الإثيلين"
            ],
            "correct": 2
          },
          {
            "text": "يجعل الثمار الناضجة طرية وأكثر حلاوة من الثمار غير الناضجة",
            "options": [
              "الأكسينات",
              "الجبريلينات",
              "السيتوكينينات",
              "الإثيلين"
            ],
            "correct": 3
          },
          {
            "text": "ينتقل الأكسين في النبات عن طريق خاصية",
            "options": [
              "الانتشار",
              "النقل النشط",
              "الضغط الجذري",
              "الأسموزية"
            ],
            "correct": 1
          }
        ]
      },
      {
        "id": 7,
        "name": "التكاثر في النباتات الزهرية",
        "description": "تتضمن دورات حياة النباتات طرائق مختلفة للتكاثر",
        "questions": []
      }
    ]
  };